---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFC.IFCExtrusionData
source: html/3d828b59-ef91-7cd2-9248-00380c14d519.htm
---
# IFCExtrusionData Members

Constructs a new empty extrusion data object.